source/_static/diagrams/41-test-vs-config.d2
direction: right
n0: "test class"
n1: "reframe.py"
n2: "system"
n3: "partition"
n4: "environment"
n1 -> n2
n1 -> n3
n1 -> n4
